<template>
  <div class="article-list">
    <div class="item">
      <span>{{blog_data.author}}</span>
      <div class="status">发布于：2050-10-01 | 阅读：3500 | 标签：#{{blog_data.blog_type}} #HTML</div>
      <div class="content">9年里，我始终对房子有一种执念。

我诞生的房子在东北长白山深处的一个小林场，如今我除了房子外面的狗窝，已经不记得它的模样。

对狗窝印象深刻是因为那时候养的狗，叫小黑，毛色黑白相间，脸尖尖的，有一条白色条纹，点缀着黑溜溜的眼睛，面相像一只狐狸，性情却温和忠厚，我那时候只有5岁左右，抱它、追它、拉它的尾巴，他始终不恼。

它的窝里总是堆满干草，家里养的母鸡总是喜欢到它窝里下蛋，鸡来下蛋的时候他就会让出窝，顺从的待在外面，我和它一起看鸡下蛋。等鸡下蛋下的多了，我妈忘了捡，它甚至会提醒她。用我爸的话说，它是一只好狗。5岁前的记忆不多，关于这所房子，我好像只记得这只狗。

还有它离我外婆家很近，很小却有一个大火炕。我爸爸在我很小的时候我想是有一点酗酒的，因为记忆里他总是喝醉了酒躺在炕上，而且爸爸妈妈会吵架。


后来搬家搬到镇上，我和小黑一起坐在小卡车上，走过长长的路，长大后我才知道这段路只有9公里，不过就是现在北上广一个上班族上班的路程。

怀着对未知的恐惧，我搬进了生命中的第二所房子。我在这房子里生活的的时间最久，对它有一种隐秘的情感，混合着怀恋和厌恶。

它在一条窄窄的巷子深处，地势很高，左右都是洼地，三面都是自家菜园，占地很大，房子本身却很小，长条形的自建房，坡顶砖墙，从中间一分为二，一部分属于我家，另一部分给爷爷奶奶居住。

房子两边都是一样的结构，门一进去就是厨房，很大的一口土灶连着小房间的炕，晚上做好饭菜，炕头也就热了，只要再填几块柴，就可以整晚安眠。边进是则个大房间，有床、沙发和电视，不仅是卧室还充当着客厅的角色，只有小房间铺了地板，大房间和厨房都是刮平的水泥地，直接穿鞋进出，永远有泥印和尘土，方便但不美观。

我们一家三口住的单面如果按现在的商品房折算面积也就只有40平上下，住的很是局促，但不知道为什么我那时候总觉得房子很大，也许是因为有院子的缘故。


如果按现在买房子对地段的考量，这个房子的条件无疑很恶劣。地处小镇远离中心的“贫民区”，紧邻化工厂，我记不清楚那个厂具体是生产什么的，但是它有一个常年排放烟雾的大烟囱高高耸立，巷子口的小水沟里永远留着它排放的废水，浓黑色，热气腾腾的翻滚着白泡，冬天的时候因为热水流过产生的白雾弥漫，会让整条巷子都看起来很神秘，气味儿倒是并不刺鼻，有点像腐烂的树木，那时候我不懂这些东西会伤害身体，经常在水沟附近玩的忘了回家，因为有这人工的“仙气”，假装起仙女来毫不费力。


这所房子承载了我整个孤单和不安的童年，爸爸妈妈都不在镇里工作，妈妈远在九公里外，每天骑车上下班，爸爸更远，一周才回家一次。

我常年跟爷爷奶奶一起生活，奶奶是我见过最粗线条的女人，做菜难吃，不擅家务。房间里总是乱糟糟的有疏于清理的霉味儿，饭桌上永远都是因为反复加热变黄发酸的馒头花卷，和颜色焦糊难以分辨食材的的炖菜。爷爷对我的宠爱几乎是那段时间里唯一的亮色，他经常从很少的退休金里拿些零钱给我买吃的，跟我玩几乎所有大人都会觉得无聊的扑克牌游戏，还会故意输给我，不厌其烦的看我画难看的蜡笔画，用木头做玩具给我，跟我一起搬小板凳坐在大门口等我妈妈回家......

同样也是他教会了我用电饭煮米饭和粥和给灶头引火添柴（虽然我当时还没到学这些的年龄）。

但是爷爷和奶奶几乎一辈子关系紧张，他们之间时常爆发激烈的争吵，内容就是翻旧账夹杂着无意义的谩骂和互相指责，吵架很可怕，吵架平息后更可怕。因为奶奶会余愤难平的迁怒与我，面目狰狞，威胁打骂，我太小没有勇气反抗只能躲开，锁上我们房间所有的门窗，拉上窗帘躲在被子里等一切平息。

至今我还还是难以理解那时奶奶对一个孩子的怒火从何而来，甚至一度怀疑她的精神不太正常，不过如今我回去见她，她的胖了许多头发雪白，早已不是记忆里强势的模样，只觉得她是一个平凡苍老又无害的普通老人，每次见到我直说我瘦了，对于往事绝口不提。


不安全的感觉除了内部还来自周遭，最危险的记忆是关于一个长着扁脸的男人，我已经不记得他具体的样子，只记得他脸上的轮廓很浅，五官像被压扁了一样，应该还很年轻，算是青年，没什么存在感的样子，看起来很和善。

我和几个住在附近的玩伴在巷口玩，那里马路边有一小块荒地，横着放置着几根很粗的水泥柱，我们把那里当成游乐场，经常爬上爬下的玩到忘了回家吃饭。

有一天下午我们遇到这个男人，他说我们玩的不好，他的玩法更好玩，就是让我们依次从水泥管的一端爬进去，从另外一端爬出来。我们可以比谁更快，他负责裁判算时间，这个游戏创意让我们很兴奋，毕竟是处在热爱竞赛的年纪，大家都很开心，都想尽快轮到自己爬。

但是轮到我的时候我刚爬了一段就感觉很奇怪，周身阴冷想吐，当时是夏天，很温暖，水泥柱也并不长，有橘色的阳光从另外一边的洞口洒进来，能看清细小的灰尘在暖光里跳跃颤动，突然我就不想再爬了，转过身正迎上男人灼热的目光，也找到了寒意和危险的源头，就在那个男人的眼睛里。

我很快就推脱自己身体不舒服远离了那场游戏，回到家里不舒服想吐的感觉持续了很久，却很难理解是为什么。

直到长大以后我才明白，夏天小女孩们爬水泥管内裤就会暴露在外面，而那个男人就是一个偷看儿童内裤的恋童癖。

除了恋童癖还有偷窥狂，我三姑有段时间住在爷爷奶奶隔壁房间，未嫁的年纪正年轻，我很喜欢她，有一天下雨很大，我在她房间玩，正觉得有些困要回自己房间，却抬头看见窗玻璃上有张人脸，那个房子的窗是那种老式木窗，两层，内层是玻璃，外层是两块木板，完全关上之后就只有最上面两块玻璃透光，所以只能看见偷窥者的脸看不见他的身体，一刹那会觉得是一张人脸悬在半空，很是诡异。

我当时应该是叫出了声，惊得爸爸赶过来又追出去到屋后菜园想抓到偷窥的人，那人却早就跑了。只有窗台上的泥脚印能证明不是我出现了幻觉。从那之后，我产生了对窗户的恐惧，晚上从来敢往窗外看，如果睡觉的地方窗帘过薄，也会惴惴不安。


就是这样一个地方，也会令我依恋，因为那里有我小时候和爷爷在巷口看过数次的夕阳，东北夏天的天空干净的蓝，衬的太阳又大又美，风又吹来各种植物的香气。

在这所房子里随我而来的小黑狗死了，死于一次跟小偷的勇敢搏斗，对于它的死亡，我除了哭别无办法。后来我们在陆续养了许多狗，鼎盛时期甚至有七八只，不过最好的狗，还是小黑。

我的爷爷也在这里去世，黑色素肿瘤，离开的很快也很痛苦。在他饱受疼痛折磨的那段日子里我不敢看他的脸，找借口不去他的房间，在他离世后，我对自己种卑鄙的怯懦产生了恨意，恨自己没能告诉他我爱他，我感谢他，我害怕他离开我......

爷爷是在我可怜的童年里一个代表着温暖和爱意的人，他的离世再一次让我明白，人在死亡面前，除了哭泣，毫无办法。

上高中的时候，爸爸终于花了八万块钱从他朋友那里买来了一套楼房，位置在镇中心，只是房子年代久远了一点，而且因为没有余钱再重新装修，所有的家具陈设都是别人用过的。即便这样我也很开心，因为上学能少走不少路，镇里的路况也比较好，遇到雨雪天也不会再走的鞋上裤子上都是泥水。

更因为新家里有集体供暖的暖气，冬天再也不用在杯子里的水都会结冰的房间里做作业和睡觉，在那时候的我看来新家干净温暖明亮，搬进来就对原来那个房子再无眷恋。

而且那时候正是虚荣敏感的年纪，搬到楼房里意味着不必再在代表着贫穷和窘迫的“平房”里居住，因此在搬家后的很长一段时间里我都没有回老房子看看的念头，那个房子至今爸爸也没有卖，奶奶夏天还会回去居住，种种菜。

现在我定居在魔都，难得回老家几次。可是不知道为什么，我总会梦见自己穿过长长的巷子，看见老房子的砖墙，然后告诉自己：“到家了。”

我现在居住的房子没有太多故事，是结婚三年之后买的，在上海的外环外。贷款30年，花光了所有积蓄，跟亲戚借钱借了个遍。没有预算装修，多花了许多心思才算住的舒适。因为地段尴尬，每天我去市中心上班来回要花接近四小时。

听起来很苦，可是谁的人生又能不掺一点苦味儿呢？至少每天加班结束，在地铁上咽下着这些苦涩，有一个能称为家的地方在等我。

我想之所以谁都想拥有一所自己的房子，是因为它是一个承载记忆的巨大容器。它也可以作为所有故事的开头：我有一所房子......</div>

      <router-link to="/senior_say_home">收起</router-link>
      <router-view></router-view>

      <a href="javascript:void()" v-on:click="xs" v-if="!more">查看评论</a>
      <a href="javascript:void()" v-on:click="xs" v-else>收起评论</a>
      <div v-if="more">
        <comment></comment>
      </div>
    </div>
    <i class="el-icon-caret-top" style="display:inline" v-on:click="increment"></i>
    <span>{{this.good}}</span>
    <span>个点赞</span>
  </div>
</template>

<script>
import comment from "./comment.vue";
export default {
  mounted: function() {
    this.cs();
  },
  computed: {},
  data() {
    return {
      id: this.$route.params.id,
      more: false,
      good: 0,
      status_zan: true,
      blog_data: this.$store.state.receive_blog,
      blog_data1: {}
    };
  },
  components: {
    comment
  },
  methods: {
    cs() {},
    xs: function() {
      this.more = !this.more;
    },
    increment() {
      if (this.status_zan) this.good = this.good + 1;
      else this.good = this.good - 1;
      this.status_zan = !this.status_zan;
    }
  }
};
</script>
<style>
.article-list,
.article {
  margin-right: 30%;
  background: #fff;
  padding: 20px 30px;
  -webkit-box-shadow: 0 0 3px 2px rgba(0, 0, 0, 0.2);
  box-shadow: 0 0 3px 2px rgba(0, 0, 0, 0.2);
}

.article-list .item {
  margin-bottom: 25px;
}

.article-list .item .title,
.article .title {
  color: #454545;
  font-size: 22px;
  font-weight: 700;
}

.article-list .item .status,
.article .status {
  font-size: 13px;
  color: #ccc;
}

.article-list .item > *,
.article > * {
  margin: 10px 0;
}
</style>